const { SlashCommandBuilder, EmbedBuilder } = require('discord.js');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('wordoftheday')
        .setDescription('Generates a random Greek word of the day.'),
    async execute(interaction) {
        
        const greekWords = [
            'αγάπη', 'φως', 'ουρανός', 'θάλασσα', 'ελευθερία', 'δημοκρατία', 'ιστορία', 'ποίηση', 'φιλοσοφία',
            'άνθρωπος', 'γυναίκα', 'άνδρας', 'παιδί', 'μαμά', 'μπαμπάς', 'σπίτι', 'φίλος', 'φίλη', 'ζωή',
            'ναι', 'όχι', 'καλημέρα', 'καλησπέρα', 'καληνύχτα', 'γεια', 'αντίο', 'ευχαριστώ', 'παρακαλώ', 'συγγνώμη',
            'ψωμί', 'γάλα', 'τυρί', 'μήλο', 'πορτοκάλι', 'νερό', 'φαγητό', 'καφές', 'τσάι', 'χυμός',
            'ζάχαρη', 'αλάτι', 'πίτα', 'σαλάτα', 'κρέας', 'κοτόπουλο', 'ψάρι', 'ρύζι', 'μακαρόνια', 'ζυμαρικά',
            'ντομάτα', 'πατάτα', 'αγγούρι', 'κρεμμύδι', 'σκόρδο', 'λεμόνι', 'ψυγείο', 'τηλέφωνο', 'τηλεόραση', 'υπολογιστής',
            'δρόμος', 'αυτοκίνητο', 'ποδήλατο', 'τρένο', 'λεωφορείο', 'ταξί', 'αεροπλάνο', 'καράβι', 'στάση', 'φανάρι',
            'μάτι', 'αυτί', 'μύτη', 'στόμα', 'χέρι', 'πόδι', 'κεφάλι', 'μαλλιά', 'καρδιά', 'στομάχι',
            'νοσοκομείο', 'φαρμακείο', 'ιατρός', 'νοσοκόμα', 'ασθενής', 'φάρμακο', 'θεραπεία', 'πονόλαιμος', 'πυρετός', 'βήχας',
            'βιβλίο', 'εφημερίδα', 'περιοδικό', 'γράμμα', 'σχολείο', 'δασκάλα', 'μαθητής', 'γράψιμο', 'διαβάζω', 'μαθαίνω',
            'μαύρο', 'άσπρο', 'κόκκινο', 'μπλε', 'πράσινο', 'κίτρινο', 'καφέ', 'γκρι', 'πορτοκαλί', 'μωβ',
            'ήλιος', 'φεγγάρι', 'αστέρι', 'σύννεφο', 'βροχή', 'χιόνι', 'άνεμος', 'ομίχλη', 'ουράνιο τόξο', 'καιρός',
            'πρωί', 'μεσημέρι', 'απόγευμα', 'βράδυ', 'νύχτα', 'ώρα', 'λεπτό', 'δευτερόλεπτο', 'ημέρα', 'εβδομάδα',
            'μήνας', 'χρόνος', 'Δευτέρα', 'Τρίτη', 'Τετάρτη', 'Πέμπτη', 'Παρασκευή', 'Σάββατο', 'Κυριακή', 'χειμώνας',
            'άνοιξη', 'καλοκαίρι', 'φθινόπωρο', 'μήλο', 'αχλάδι', 'ροδάκινο', 'κεράσι', 'φράουλα', 'σταφύλι', 'καρπούζι',
            'πεπόνι', 'ανανάς', 'μπανάνα', 'σουβλάκι', 'μουσακάς', 'μελιτζάνα', 'γεμιστά', 'σπανακόπιτα', 'φέτα', 'ελιά',
            'λάδι', 'κρασί', 'μπύρα', 'ούζο', 'τσίκινο', 'νερό', 'σόδα', 'λεμονάδα', 'πορτοκαλάδα', 'γλυκό',
            'παγωτό', 'τούρτα', 'κέικ', 'μπισκότο', 'σοκολάτα', 'καραμέλα', 'γλυκό', 'μηλόπιτα', 'κρέμα', 'σούπα',
            'κουτάλι', 'πιρούνι', 'μαχαίρι', 'ποτήρι', 'πιάτο', 'τραπέζι', 'καρέκλα', 'καναπές', 'κρεβάτι', 'ντουλάπα',
            'καθρέφτης', 'βιβλιοθήκη', 'λάμπα', 'κουρτίνα', 'παράθυρο', 'πόρτα', 'δωμάτιο', 'κουζίνα', 'μπάνιο', 'σαλόνι',
            'ύπνος', 'όνειρο', 'ξυπνητήρι', 'πρωινό', 'μεσημεριανό', 'δείπνο', 'πείνα', 'δίψα', 'υγεία', 'ασφάλεια',
            'αγορά', 'κατάστημα', 'σούπερ μάρκετ', 'φαρμακείο', 'ταχυδρομείο', 'τράπεζα', 'ξενοδοχείο', 'εστιατόριο', 'καφετέρια', 'κλινική',
            'πόλη', 'χωριό', 'πλατεία', 'πάρκο', 'παραλία', 'βουνό', 'δάσος', 'λίμνη', 'ποτάμι', 'νησί',
            'χώρα', 'κράτος', 'σημαία', 'εθνική', 'γλώσσα', 'παράδοση', 'μουσική', 'χορός', 'τραγούδι', 'φωτογραφία',
            'φιλία', 'οικογένεια', 'γονείς', 'αδερφός', 'αδερφή', 'ξάδερφος', 'παππούς', 'γιαγιά', 'θείος', 'θεία',
            'σχολείο', 'πανεπιστήμιο', 'τάξη', 'μάθημα', 'εκπαιδευτικός', 'μαθητής', 'μαθήτρια', 'βιβλίο', 'τετράδιο', 'στυλό',
            'μολύβι', 'γόμα', 'χάρακας', 'καθηγητής', 'καθηγήτρια', 'έκθεση', 'ιστορία', 'μαθηματικά', 'φυσική', 'χημεία',
            'βιολογία', 'γεωγραφία', 'γυμναστική', 'τέχνη', 'θέατρο', 'κινηματογράφος', 'ταινία', 'σκηνοθέτης', 'ηθοποιός', 'κωμωδία',
            'δράμα', 'εικαστικά', 'ζωγραφική', 'γλυπτική', 'μουσείο', 'αρχαιολογία', 'ιστορικός', 'ανασκαφή', 'παλαιό', 'σύγχρονο',
            'ποδόσφαιρο', 'μπάσκετ', 'βόλεϊ', 'κολύμβηση', 'τρέξιμο', 'ποδηλασία', 'σκι', 'τανκ', 'γυμναστική', 'άθλημα',
            'νίκη', 'ήττα', 'ισοπαλία', 'προπόνηση', 'πρωτάθλημα', 'κύπελλο', 'μετάλλιο', 'προπονητής', 'αθλητής', 'διαιτητής',
            'παιχνίδι', 'χόμπι', 'βόλτα', 'βιβλίο', 'μουσική', 'κιθάρα', 'πιάνο', 'χορός', 'τραγούδι', 'ζωγραφική',
            'φωτογραφία', 'ταξίδι', 'διακοπές', 'ξεκούραση', 'διασκέδαση', 'πάρτι', 'γενέθλια', 'γιορτή', 'συναυλία', 'θέατρο',
            'κινηματογράφος', 'ταινία', 'βιβλιοθήκη', 'παιχνίδι', 'κάστρο', 'μουσείο', 'εκκλησία', 'προσευχή', 'θεός', 'αγάπη',
            'ειρήνη', 'ελπίδα', 'πίστη', 'θρησκεία', 'φιλοξενία', 'σεβασμός', 'τιμή', 'υποχρέωση', 'δικαίωμα', 'ελευθερία',
            'εργασία', 'δουλειά', 'επάγγελμα', 'καριέρα', 'συνάδελφος', 'εργοδότης', 'εργαζόμενος', 'γραφείο', 'τηλέφωνο', 'υπολογιστής',
            'ηλεκτρονικό ταχυδρομείο', 'μήνυμα', 'συνάντηση', 'πελάτης', 'παραγγελία', 'αγορά', 'πώληση', 'τιμολόγιο', 'απόδειξη', 'πληρωμή',
            'τραπεζικός λογαριασμός', 'δάνειο', 'επιταγή', 'προϋπολογισμός', 'οικονομία', 'επένδυση', 'κεφάλαιο', 'κέρδος', 'ζημία', 'φόρος',
            'συμβόλαιο', 'συμφωνία', 'συνθήκη', 'νόμος', 'δικηγόρος', 'δικαστήριο', 'κρίση', 'αποφάση', 'έγκλημα', 'αστυνομία',
            'αστυνομικός', 'δικαστής', 'φυλακή', 'ποινή', 'ασφάλεια', 'επικίνδυνο', 'προστασία', 'σύστημα', 'ηθική', 'κοινωνία',
            'πολιτική', 'κυβέρνηση', 'βουλή', 'εκλογές', 'ψήφος', 'κόμμα', 'πολιτικός', 'υπουργός', 'πρόεδρος', 'πρωθυπουργός',
            'διπλωματία', 'σχέσεις', 'συμμαχία', 'πόλεμος', 'ειρήνη', 'στρατός', 'ναυτικό', 'αεροπορία', 'όπλο', 'μάχη',
            'στρατιώτης', 'εχθρός', 'κατάσκοπος', 'αποστολή', 'ηρωισμός', 'θυσία', 'πατρίδα', 'σημαία', 'σύμβολο', 'ιστορία',
            'μυθολογία', 'ήρωας', 'θρύλος', 'παραμύθι', 'διήγηση', 'γραφή', 'ποίημα', 'ποιητής', 'συγγραφέας', 'λογοτεχνία',
            'χαρά', 'λύπη', 'οργή', 'φόβος', 'έκπληξη', 'θλίψη', 'θυμός', 'έρωτας', 'πάθος', 'ελπίδα'
        ];

        // make it so that each time the bot turns off the word count stays
        // add a skip button?
        
        const randomIndex = Math.floor(Math.random() * greekWords.length);
        const wordOfTheDay = greekWords[randomIndex];
        const wordCountSoFar = interaction.client.wordCount || 0;
        interaction.client.wordCount = wordCountSoFar + 1;

        const embed = new EmbedBuilder()
            .setColor(0xFFFFFF)
            .setTitle('Greek Word of the Day')
            .setDescription(`**#${wordCountSoFar + 1}/${greekWords.length}**`)
            .addFields({name: 'Word', value: wordOfTheDay});
        
        await interaction.reply({ embeds: [embed] });
    },
};
